/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   push_cmd.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: szhakypo <szhakypo@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/06/14 22:09:17 by szhakypo          #+#    #+#             */
/*   Updated: 2022/06/14 22:10:41 by szhakypo         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*pa : push a — взять первый элемент в верхней части b и поместить его в
				верхнюю часть a. Ничего не делать, если b пусто.
pb : push b — взять первый элемент в верхней части a и поместить его в
				верхнюю часть b. Ничего не делать, если a пусто.*/

void	pa(t_var)